# Напишите функцию, находящую среднее арифметическое всех аргументов
# Функция должна вызываться с любым количеством аргументов

def average(*args):
def average(*args):
    s = 0
    for el in args:
        s += el
    if len(args) == 0:
        return False
    return s / len(args)
    pass


print(average(3, 4, 8))
print(average(1, 4, 5, -3, 8, 4))
print(average(-10, 12, 6.3, -5.5, 7, 0.2))
